# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.17-s066_1 on Tue Dec 19 23:39:32 EST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design note_tuner

group_path -weight 1.000000 -name cg_enable_group_default -through [list \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST0/RC_CGIC_INST/E] ]
set_clock_gating_check -setup 0.0 
